solo_riblet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          27;
        startFace       2293;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          27;
        startFace       2320;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          68;
        startFace       2347;
    }
    atmosphere
    {
        type            patch;
        nFaces          44;
        startFace       2415;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2376;
        startFace       2459;
    }
)

// ************************************************************************* //
